Tekla Open API Reference for Tekla Structures 2025
BendSurface.InwardCurved Property
 Gets the direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool InwardCurved { get; }
Public ReadOnly Property InwardCurved As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace